In [1]:
!python training.py

got here not test folder
got here1
creating 11x5 array of gloatingpoint numbers
       cols0     cols1     cols2     cols3     cols4
0   0.540064  0.589966  0.107366  0.249146  0.735356
1   0.860027  0.517485  0.772369  0.177694  0.962729
2   0.204505  0.315678  0.793786  0.067787  0.993291
3   0.816699  0.621105  0.296204  0.120276  0.589657
4   0.188135  0.467200  0.926463  0.974479  0.244411
5   0.944953  0.368053  0.717415  0.830007  0.479039
6   0.275863  0.238581  0.834321  0.024647  0.043430
7   0.692921  0.721740  0.558893  0.043261  0.567772
8   0.864188  0.161258  0.277770  0.895580  0.316775
9   0.234197  0.830245  0.917273  0.433872  0.323999
10  0.890672  0.449438  0.868388  0.980104  0.111334
got here2
get the data from a csv which contains cities, countries, and country codes
changing cities_countries_codes to dataFrame
displaying cities_countries_codes_dfcontent



               city country  code
0             tokyo   japan    81
1             delhi   india    91
2             accra   ghana   233
3            dayton     USA     1
4          Shanghai   china    86
5            mumbai   india    91
6            beijin   china    86
7          sao palo  brazil    55
8   rayo de janeiro  brazil    55
9             kyoto   japan    81
10           kumasi   ghana   233
11       washington     USA     1
12          ontario  canada     1
13          calgary  canada     1
got here3
got here4
got here5
Using CPU

Tensor x:
tensor([[ 0.3505,  0.4271,  1.0571, -0.4647],
        [ 0.3125, -0.0665,  1.3178, -2.2013],
        [ 0.0932,  1.6120, -1.7121, -2.0453]])
Shape of x: torch.Size([3, 4])
Device of x: cpu

Addition operation (x + y):
tensor([[ 0.2178,  1.0221, -0.0290,  0.6925],
        [-0.3963,  1.5805,  1.3451, -2.2889],
        [ 0.9554,  2.5027,  0.0629, -1.6239]])

In-place addition (y.add_(x)):
tensor([[ 0.2178,  1.0221, -0.0290,  0.6925],
        [-0.3963,  1.5805,  1.3451, -2.2889],
        [ 0.9554,  2.5027,  0.0629, -1.6239]])

Autograd example:
Gradient of a with respect to c: tensor([0.6067])
Gradient of b with respect to c: tensor([-0.5426])

In [2]:
%run training

got here not test folder
got here1
creating 11x5 array of gloatingpoint numbers
       cols0     cols1     cols2     cols3     cols4
0   0.741448  0.706056  0.830758  0.918938  0.935177
1   0.780681  0.531223  0.020934  0.343238  0.559726
2   0.857075  0.698514  0.120463  0.896601  0.509719
3   0.201956  0.951157  0.293118  0.259564  0.162422
4   0.271927  0.608439  0.221572  0.016618  0.405027
5   0.558795  0.199454  0.004761  0.664961  0.259242
6   0.791020  0.388551  0.807544  0.678048  0.694693
7   0.001115  0.472697  0.071059  0.130698  0.179463
8   0.132035  0.287455  0.566099  0.568888  0.625059
9   0.824935  0.889117  0.182484  0.001589  0.189193
10  0.150859  0.401608  0.570018  0.794419  0.521650
got here2
get the data from a csv which contains cities, countries, and country codes
changing cities_countries_codes to dataFrame
displaying cities_countries_codes_dfcontent



               city country  code
0             tokyo   japan    81
1             delhi   india    91
2             accra   ghana   233
3            dayton     USA     1
4          Shanghai   china    86
5            mumbai   india    91
6            beijin   china    86
7          sao palo  brazil    55
8   rayo de janeiro  brazil    55
9             kyoto   japan    81
10           kumasi   ghana   233
11       washington     USA     1
12          ontario  canada     1
13          calgary  canada     1
got here3
got here4
got here5
Using CPU

Tensor x:
tensor([[-1.2175,  1.4713,  0.5942, -1.4126],
        [-0.7840, -0.0919, -0.0145, -2.5656],
        [-1.0219, -0.5934,  0.9630, -0.3938]])
Shape of x: torch.Size([3, 4])
Device of x: cpu

Addition operation (x + y):
tensor([[-1.1542,  2.2281,  1.8819, -2.7073],
        [-3.2402, -0.1715, -0.9127, -4.1721],
        [-0.6830, -0.6780,  0.7766, -0.9192]])

In-place addition (y.add_(x)):
tensor([[-1.1542,  2.2281,  1.8819, -2.7073],
        [-3.2402, -0.1715, -0.9127, -4.1721],
        [-0.6830, -0.6780,  0.7766, -0.9192]])

Autograd example:
Gradient of a with respect to c: tensor([1.7218])
Gradient of b with respect to c: tensor([0.4437])

In [10]:
%run training

got here not test folder
got here1
creating 11x5 array of gloatingpoint numbers
       cols0     cols1     cols2     cols3     cols4
0   0.269077  0.532843  0.075930  0.943689  0.019614
1   0.013268  0.980989  0.454522  0.846051  0.558448
2   0.028378  0.239382  0.047115  0.862336  0.796924
3   0.314152  0.110113  0.765868  0.978860  0.734885
4   0.991648  0.640544  0.606968  0.644691  0.839015
5   0.508247  0.980243  0.487031  0.048487  0.507845
6   0.096761  0.067642  0.687723  0.482784  0.805369
7   0.295158  0.699810  0.350442  0.327107  0.198137
8   0.169663  0.760063  0.702100  0.930539  0.899324
9   0.431406  0.056558  0.776495  0.692121  0.038143
10  0.340880  0.865983  0.823896  0.015165  0.944882
got here2
get the data from a csv which contains cities, countries, and country codes
changing cities_countries_codes to dataFrame
displaying cities_countries_codes_dfcontent



               city country  code
0             tokyo   japan    81
1             delhi   india    91
2             accra   ghana   233
3            dayton     USA     1
4          Shanghai   china    86
5            mumbai   india    91
6            beijin   china    86
7          sao palo  brazil    55
8   rayo de janeiro  brazil    55
9             kyoto   japan    81
10           kumasi   ghana   233
11       washington     USA     1
12          ontario  canada     1
13          calgary  canada     1
got here3
got here4
got here5
Using CPU

Tensor x:
tensor([[ 1.0711, -1.2666,  0.0770, -0.6730],
        [ 0.8486, -0.2941, -0.8619, -1.3592],
        [-0.7493, -0.2363, -0.2265, -1.3699]])
Shape of x: torch.Size([3, 4])
Device of x: cpu

Addition operation (x + y):
tensor([[-0.5269, -0.2473,  0.8741, -1.2672],
        [ 2.4112, -1.3710, -0.4354, -0.4320],
        [-0.5594, -1.8329,  1.1958, -1.8273]])

In-place addition (y.add_(x)):
tensor([[-0.5269, -0.2473,  0.8741, -1.2672],
        [ 2.4112, -1.3710, -0.4354, -0.4320],
        [-0.5594, -1.8329,  1.1958, -1.8273]])

Autograd example:
Gradient of a with respect to c: tensor([-3.3945])
Gradient of b with respect to c: tensor([0.2726])

In [11]:
df2.tail()

        City Country  Population_Millions
0      Tokyo   Japan                 37.3
1      Delhi   India                 32.0
2   Shanghai   China                 28.5
3  Sao Paulo  Brazil                 22.4
4     Mumbai   India                 20.4

In [5]:
df3

        City Country Population_Millions
0      Tokyo   Japan                   1
1      Delhi   India                 two
2   Shanghai   China                   3
3  Sao Paulo  Brazil                   4
4     Mumbai   India                five

In [6]:
num_py_random_data_to_Pd_df

       cols0     cols1     cols2     cols3     cols4
0   0.268644  0.386940  0.637864  0.100752  0.773990
1   0.281066  0.539653  0.405855  0.853254  0.073335
2   0.670290  0.511594  0.162539  0.188338  0.861976
3   0.048959  0.803308  0.560452  0.328199  0.003229
4   0.681891  0.167983  0.863808  0.958303  0.096481
5   0.373816  0.527902  0.214054  0.875844  0.295760
6   0.134376  0.897992  0.750934  0.902963  0.790986
7   0.456482  0.860461  0.287633  0.750560  0.355656
8   0.647050  0.958657  0.964948  0.652417  0.191217
9   0.966081  0.301908  0.457105  0.694486  0.226523
10  0.585753  0.900133  0.704310  0.975838  0.825395

In [7]:
df

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,2
146,6.3,2.5,5.0,1.9,2
147,6.5,3.0,5.2,2.0,2
148,6.2,3.4,5.4,2.3,2
149,5.9,3.0,5.1,1.8,2

In [8]:
cities_countries_codes_df

               city country  code
0             tokyo   japan    81
1             delhi   india    91
2             accra   ghana   233
3            dayton     USA     1
4          Shanghai   china    86
5            mumbai   india    91
6            beijin   china    86
7          sao palo  brazil    55
8   rayo de janeiro  brazil    55
9             kyoto   japan    81
10           kumasi   ghana   233
11       washington     USA     1
12          ontario  canada     1
13          calgary  canada     1

In [9]:
cities_countries_codes_df

               city country  code
0             tokyo   japan    81
1             delhi   india    91
2             accra   ghana   233
3            dayton     USA     1
4          Shanghai   china    86
5            mumbai   india    91
6            beijin   china    86
7          sao palo  brazil    55
8   rayo de janeiro  brazil    55
9             kyoto   japan    81
10           kumasi   ghana   233
11       washington     USA     1
12          ontario  canada     1
13          calgary  canada     1